#ifndef __FC_TERRAIN_ATTR_DEFINITIONS_H__
#define __FC_TERRAIN_ATTR_DEFINITIONS_H__

enum FC_TILE_TYPE
{
	FCTT_AB_00 = 0,//(마계기본땅)
	FCTT_AB_01 = 1,//(마계바닥1))
	FCTT_AB_02 = 2,//(마계돌)
	FCTT_AB_03 = 3,//(마계마른용암)
	FCTT_AB_04 = 4,//(마계용암)
	FCTT_CS_00 = 5,//(성쇄도시 기본흙)
	FCTT_CS_01 = 6,//(성쇄도시 인공돌바닥
	FCTT_CS_02 = 7,//(성쇄도시 인공돌바닥
	FCTT_CS_03 = 8,//(성쇄도시 절벽)
	FCTT_CS_04 = 9,//(성쇄도시 풀)
	FCTT_FM_00 = 10,//(농촌 기본흑)
	FCTT_FM_01 = 11,//(농촌 인공돌바닥3)
	FCTT_FM_02 = 12,//(농촌 돌)
	FCTT_FM_03 = 13,//(농촌 기본풀)
	FCTT_FM_04 = 14,//(농촌 거친풀)
	FCTT_FR_00 = 15,//(숲 기본풀)
	FCTT_FR_01 = 16,//(숲 이끼풀)
	FCTT_FR_02 = 17,//(숲 돌)
	FCTT_FR_03 = 18,//(숲 기본흙)
	FCTT_FR_04 = 19,//(숲 페허용 돌바닥)
	FCTT_GV_00 = 20,//(고블린 마른땅)
	FCTT_GV_01 = 21,//(고블린 풀&마른땅)
	FCTT_GV_02 = 22,//(고블린 돌)
	FCTT_GV_03 = 23,//(고블린 거친마른땅)
	FCTT_GV_04 = 24,//(고블린 풀&갈라진땅)
	FCTT_MP_00 = 25,//(산길 흙)
	FCTT_MP_01 = 26,//(산길 흙&돌)
	FCTT_MP_02 = 27,//(산길 돌)
	FCTT_MP_03 = 28,//(산길 거친흙)
	FCTT_MP_04 = 29,//(산길 풀)
	FCTT_OC_00 = 30,//(설원 눈)
	FCTT_OC_01 = 31,//(설원 눈2)
	FCTT_OC_02 = 32,//(설원 돌)
	FCTT_OC_03 = 33,//(설원 절벽)
	FCTT_OC_04 = 34,//(설원 인공 돌바닥)
	FCTT_PL_00 = 35,//(평원 기본풀)
	FCTT_PL_01 = 36,//(평원 거친풀)
	FCTT_PL_02 = 37,//(평원 흙)
	FCTT_PL_03 = 38,//(평원 돌)
	FCTT_PL_04 = 39,//(평원 흙&돌)
	FCTT_VF_02 = 40,//(농촌 돌2)
	FCTT_WATER = 41,//임시로 물
	FC_TILE_TYPE_LAST
};

int g_nTerrainParticleTable[ FC_TILE_TYPE_LAST ] =
{
	0, // 어두운 흙		FCTT_AB_00,//(마계기본땅)
	5, //X없음		FCTT_AB_01,//(마계바닥1))
	5, //X없음		FCTT_AB_02,//(마계돌)
	5, //X없음		FCTT_AB_03,//(마계마른용암)
	5, //X없음		FCTT_AB_04,//(마계용암)
	1, // 황사		FCTT_CS_00,//(성쇄도시 기본흙)
	5, //X없음		FCTT_CS_01,//(성쇄도시 인공돌바닥
	5, //X없음		FCTT_CS_02,//(성쇄도시 인공돌바닥
	5, //X없음		FCTT_CS_03,//(성쇄도시 절벽)
	3, // 풀		FCTT_CS_04,//(성쇄도시 풀)
	1, // 황사		FCTT_FM_00,//(농촌 기본흑)
	5, //X없음		FCTT_FM_01,//(농촌 인공돌바닥3)
	5, //X없음		FCTT_FM_02,//(농촌 돌)
	3, // 풀		FCTT_FM_03,//(농촌 기본풀)
	6, // 짧은 풀	FCTT_FM_04,//(농촌 거친풀)
	3, // 풀		FCTT_FR_00,//(숲 기본풀)
	6, // 짧은 풀	FCTT_FR_01,//(숲 이끼풀)
	5, //X없음		FCTT_FR_02,//(숲 돌)
	0, // 어두운 흙	FCTT_FR_03,//(숲 기본흙)
	5, //X없음		FCTT_FR_04,//(숲 페허용 돌바닥)
	7, // 붉은 흙	FCTT_GV_00,//(고블린 마른땅)
	8, // 붉은 풀	FCTT_GV_01,//(고블린 풀&마른땅)
	5, //X없음		FCTT_GV_02,//(고블린 돌)
	7, // 붉은 흙	FCTT_GV_03,//(고블린 거친마른땅)
	8, // 붉은 풀	FCTT_GV_04,//(고블린 풀&갈라진땅)
	0, // 어두운 흙	FCTT_MP_00,//(산길 흙)
	0, // 어두운 흙	FCTT_MP_01,//(산길 흙&돌)
	5, //X없음		FCTT_MP_02,//(산길 돌)
	0, // 어두운 흙	FCTT_MP_03,//(산길 거친흙)
	3, // 풀		FCTT_MP_04,//(산길 풀)
	2, // 눈		FCTT_OC_00,//(설원 눈)
	2, // 눈		FCTT_OC_01,//(설원 눈2)
	5, //X없음		FCTT_OC_02,//(설원 돌)
	5, //X없음		FCTT_OC_03,//(설원 절벽)
	5, //X없음		FCTT_OC_04,//(설원 인공 돌바닥)
	3, // 풀		FCTT_PL_00,//(평원 기본풀)
	6, // 짧은 풀	FCTT_PL_01,//(평원 거친풀)
	0, // 어두운 흙	FCTT_PL_02,//(평원 흙)
	5, //X없음		FCTT_PL_03,//(평원 돌)
	0, // 어두운 흙	FCTT_PL_04,//(평원 흙&돌)
	5,  //X없음		FCTT_VF_02,//(농촌 돌2)
	4 //물
};

#endif
